[
 {
   "id": 1,
   "content": "\n<h1> HTML Semântico</h1>\n<p> Uma boa parte da acessibilidade, trata-se de fazer o uso do HTML semântico na hora do desenvolvimento de front-end.  Além de ter um papel importante em auxiliar os leitores de tela, que são muito utilizados por deficientes visuais, facilitam a manutenção, compreensão do documento, colaborando inclusive no rankeamento de SEO.</p>\n<br>\n<p>Algumas das tags mais importantes são:</p>\n<ul>\n<li><strong>&lt header &gt</strong> - é utilizado para representar o cabeçalho de um documento ou seção declarado no HTML.</li>\n<li><strong>&lt nav &gt</strong> - representa uma seção de uma página que aponta para outras páginas ou para outras áreas da página, ou seja, uma seção com links de navegação.</li>\n<li><strong>&lt section &gt</strong> -representa uma seção genérica contida em um documento HTML. </li>\n<li><strong>&lt footer &gt</strong> - é utilizado para representar um rodapé, que pode conter informações sobre o autor da seção de dados, direitos autorais ou links para documentos relacionados.</li>\n</ul>\n<br>\n<p>Confira todas as tags do HTML semântico na <a href=”https://developer.mozilla.org/pt-BR/docs/Glossary/Semantics>MDN Docs</a></p>"
 },
 {
   "id": 2,
   "content": "<h1>Atributo ALT</h1>\n<p>Alt text acompanha as imagens presentes no HTML, que é lido em voz alta por leitores de tela, ajudando os usuários com deficiência visual a compreender o conteúdo disponível na página. Ele também aparece na página caso o conteúdo não tenha sido carregado corretamente. Alt text é o texto escrito exibido no lugar dessas imagens.</p>\n\n<br>\n<h2>Boas práticas para o uso do atributo ALT:</h2>\n<p>O atributo de imagem “ALT” tem de ser utilizado com bom senso e a partir da seguinte idéia: tudo que for escrito nele será ouvido a toda hora que o leitor de tela passar por ele.</p>\n<p>As imagens decorativas utilizadas para decorar a página ou partes dela, deverão ser ignoradas pelos recursos de tecnologia assistiva, ou seja, deve-se deixar o conteúdo do atributo alt vazio (alt=””), para que a imagem seja ignorada pelos leitores de tela. Outra opção é utilizar essas imagens através de CSS.</p>\n<p>O texto deve ser curto e sucinto. Não existe uma restrição oficial para o tamanho do texto alternativo fornecido no alt, mas especialistas recomendam que ele seja inferior a 125 caracteres.</p>\n<br>\n<p>Fontes: <a href=”https://www.ufrgs.br/acessibilidadedigital/atributo-alt/”>UFRGS</a> e <a href=”https://imasters.com.br/acessibilidade/dica-de-acessibilidade-atributos-alt-vazios”>iMasters</a></p>\n"
 },
 {
   "id": 3,
   "content": "<h1>vLibras</h1>\n<p>O VLibras é uma plataforma de código aberto, livre e gratuita, que traduz automaticamente conteúdos digitais em diversos suportes (textos, áudios e vídeos) para a Língua Brasileira de Sinais (Libras) através de tradução automática e uso de um Avatar 3D, tornando computadores, dispositivos móveis e websites acessíveis para pessoas surdas. </p>\n<p>Na Suíte VLibras, os sinais em Libras são reproduzidos utilizando um intérprete virtual de Libras, um avatar 3D, chamado Ícaro. O VLibras também dispõe de uma ferramenta de computação humana, denominada WikiLibras, que permite que colaboradores surdos e especialistas em Libras possam manter e evoluir o seu vocabulário de sinais e suas regras de tradução. Atualmente o VLibras conta com um vocabulário composto por mais de 14 mil sinais, um dos maiores deste tipo no mundo.</p>\n<p>Adicionalmente o VLibras também dispõe de uma API (Application Programming Interface) de programação que permite que outros programadores ou desenvolvedores de software possam incluir suporte a Libras em seus sistemas, serviços e aplicações.</p>\n\n<p>Acesse a ferramenta em:<a href=”https://www.gov.br/governodigital/pt-br/vlibras”>vLibras</a></p>\n\n<p>Fonte: <a href=”https://transforma.fbb.org.br/tecnologia-social/vlibras-uma-tecnologia-livre-e-gratuita-para-inclusao-digital-de-pessoas-surdas”>Fundação BB</a></p>\n"
 },
 {
   "id": 4,
   "content": "<h1>Leitores de Tela</h1>\n\n<h2>O que são Leitores de Tela?</h2>\n<p>Leitores de tela são softwares usados para obter resposta do computador por meio sonoro, usado principalmente por deficientes visuais. O programa vai percorrendo textos e imagens e lendo em voz alta tudo o que ele encontra na tela, assim como as operações que o usuário realiza com as teclas alfanuméricas e os comandos digitados.</p>\n\n<h2>Como funciona a navegação?</h2>\n<p>A navegação por leitores de tela funciona essencialmente de três maneiras:</p>\n<ul>\n<li>Lendo toda a página (navegação com as setas)</li>\n<li>Lendo os links (navegação com a tecla TAB\n<li>Lendo os cabeçalhos (navegação com a tecla H)\n</ul>\n\n<p>A partir desses três comandos principais, o usuário consegue se guiar pela estrutura da página enquanto vai acompanhando a fala humana emitida pelo software ao ler seu conteúdo.</p>\n\n<p>Por isso mesmo é importante que tanto o design quanto o código estejam prontos para receber o usuário que navega utilizando leitores de tela. Um simples cabeçalho quebrado ou mal implementado pode fazer com que o usuário se perca na página e tenha dificuldades em entender como a informação está organizada hierarquicamente.</p>\n\n<h2>Quais são os softwares mais comuns?</h2>\n<ul>\n<li>JAWS</li>\n<li>VIRTUAL VISION</li>\n<li>NVDA</li>\n<li>Orca</li>\n<li>Voice over</li>\n</ul>\n\n<p>Fonte: <a href=”https://www.acessibilidade.ufscar.br/recursos/leitores-de-tela/leitores-de-tela”>UFSCAR</a></p>"
 },
 {
   "id": 5,
   "content": "<h1>Daltonismo</h1>\n\n<p>O daltonismo, também chamado de discromatopsia ou até mesmo de deficiência visual das cores, refere-se à dificuldade de identificar e diferenciar certos intervalos de cores.<p>\n\n<h2>Tipos de daltonismo</h2>\n<p>Existem 4 tipos conhecidos de daltonismo:</p>\n\n<h3>Protanopia\n</h3><p>Quem possui este tipo de deficiência tende a perceber menos luz vermelha. Tons de vermelho, laranja e amarelo tendem a se tornar verde e pouco saturado.</p>\n\n<h3>Deuteranopia</h3>\n<p>A pessoa tem dificuldade de perceber a luz verde e isso prejudica na distinção da luz azul, amarelo, violeta, vermelho e verde.</p>\n\n<h3>Tritanopia</h3>\n<p>Pessoas com a tritanopia confundem o azul com verde e amarelo com violeta.</p>\n\n<h3>Monocromia</h3>\n<p>É a ausência da capacidade de diferenciar as cores, resultando na visão em escala de cinza. Este é do tipo raro.</p>\n\n\n<h2>Como desenvolver para daltônicos</h2>\n<h3>Contraste de cores</h3>\n<p>Utilize contraste de cores. Mesmo quem possui a monocromia tem dificuldade de perceber as diferentes variações de luz. Para garantir que haja leitura é importante definir cores que tenham contraste. Um exemplo: um texto em branco em cima de uma cor escura de fundo terá mais contraste que um texto branco em cima de um fundo amarelo. Recentemente eu criei um post falando sobre contraste e como melhorar a acessibilidade.</p>\n\n<h3>Utilize diferentes tipos de sombra em vez de diferentes tipos de cores</h3>\n<p>Este método de construir o design por meio de um esquema monocromático ajuda a diminuir efetivamente a frustração entre cores e ajuda a criar bons contrastes.</p>\n\n<h3>Enquanto estiver criando, experimente o daltonismo</h3>\n<p>Sim. É extremamente importante se colocar no lugar de usuários quando estiver criando qualquer coisa. Existem ferramentas que simulam o olhar de um daltônico. Plugins para o Sketch e o modo de visualização no Photoshop permitem essa simulação.</p>\n"
 },
 {
   "id": 6,
   "content": "\n<h1>O que é acessibilidade na web ?</h1>\n\n<p>As barreiras também existem na web e afetam milhões de pessoas com deficiência no mundo. Atualmente, estes cidadãos com dificuldades motoras, sensoriais ou cognitivas dependem muito dos progressos em termos de acessibilidade web para não beirarem à margem do desenvolvimento educativo, econômico e social.</p>\n\n<p>Passamos em média 6 horas e 43 minutos navegando na internet todos os dias, conforme revelam dados do relatório Digital 2020 publicado pela We Are Social e Hootsuite. Apesar desses dados, a internet continua sendo um território inacessível para a grande maioria das pessoas com deficiência no mundo, conforme denuncia o consórcio internacional World Wide Web Consortium (W3C) por meio de sua Web Accessibility Initiative (WAI).</p>\n\n<p>A Acessibilidade da Web combina programação, design e tecnologia para criar uma internet sem barreiras que permite que todos os usuários compreendam, aprendam, navegam e interajam totalmente com a Web. Assim como a indústria e a arquitetura, por exemplo, objetos de design, veículos e espaços adaptados às necessidades de pessoas com mobilidade reduzida ou com deficiências cognitivas, visuais e auditivas, e a internet também precisa seguir esse caminho.</p>"
 },
 {
   "id": 7,
   "content": "<h1>Princípios da acessibilidade: </h1>\n\n<h3>Princípio 1 : Perceptível</h3>\n<p>“A informação e os componentes da interface de utilizador têm de ser apresentados de forma a que os utilizadores as possam perceber.” - w3c\nTodo conteúdo não textual deve ter uma forma de exibição alternativa para que possa ser renderizado de outras maneiras de acordo com as necessidades do usuário, como caracteres ampliados, Braille, fala, símbolos ou linguagem mais simples.</p>\n\n<p>Fornecer alternativas para conteúdo em multimédia dinâmica ou temporal. Todo áudio deve ser acompanhado de uma legenda, áudio descrição e linguagem gestual se for um conteúdo pré-gravado</p>\n\n<p>Crie conteúdo que possa ser renderizado de forma diferente (como layouts de página mais simples) sem perder informações ou estrutura.</p>\n\n<p>Torne mais fácil para os usuários ouvir e ver o conteúdo, especialmente separando o primeiro plano do plano de fundo. A apresentação de texto deve ter um contraste mínimo de 4.5:1, exceto em: texto ampliado (no mínimo 3:1) ou logotipo. Também deve ter redimensionamento de texto em até 200% sem perder o conteúdo ou funcionalidade. Sons de fundo devem ter no mínimo 20 decibéis (exceto aqueles que têm menos de 2 segundos) e podem ser desligados.</p>\n\n<h3>Princípio 2 : Operável</h3>\n\n<p>Toda funcionalidade do conteúdo deve ser operável pelo teclado. Conteúdos com limite de tempo devem ser evitados, e,  caso existam, podem desligar ou prolongar o temporizador, exceto casos específicos (leilão, por exemplo). Informações em movimento que iniciam automaticamente, duram mais de 5 segundos e aparecem em paralelo com outro conteúdo podem ser pausadas, ocultadas ou paradas.</p>\n\n<p>Não criar conteúdo de uma forma que se sabe que pode causar convulsões (com mais de 3 flashes em um segundo). </p>\n\n<p>Qualquer interface de usuário operável por teclado tem um modo de operação no qual o indicador de foco do teclado é visível.</p>\n\n\n\n<h3>Princípio 3 : Compreensível</h3>\n\n<p>O idioma humano da página pode ser alterado</p>\n\n<p>Previsibilidade: Quando qualquer componente recebe foco, o contexto não é modificado. Componentes com a mesma funcionalidade sempre devem ser identificado da mesma maneira</p>\n\n<p>Erros detectados pelo ação do usuário, o item que apresenta erro é identificado e o erro é descrito com uma sugestão para eliminar o erro</p>\n\n<h3>Princípio 4 : Robusto</h3>\n\n<p>O conteúdo deve ser robusto o suficiente para ser interpretado de forma confiável por vários agentes de usuário, incluindo tecnologias assistivas. Devem  ser utilizadas as tags adequadas e IDs exclusivos</p>"
 },

 {
"id": 8,
"content": "<h1>Tipos de fonte e acessibilidade digital</h1> <p>É muito comum falar em descrição de imagens, legenda para vídeos e suporte para teclado quando o assunto é acessibilidade digital. No entanto, uma questão igualmente importante para a acessibilidade é a escolha da fonte. Mas quais tipos de fonte são mais indicados? E que fatores tornam uma fonte mais ou menos acessível?</p> <p>Para conteúdo digital, as fontes sem serifa são consideradas mais acessíveis. Uma fonte sem serifa é aquela que não possui prolongamentos nos caracteres, ou seja, são mais limpas e facilitam a distinção entre os caracteres. Já as fontes serifadas podem dificultar a leitura para quem tem baixa visão, devido aos prolongamentos, que podem dar a impressão de que um caractere está unido ao outro.</p> <h2>Sem Serifa</h2> <p>Exemplos: Arial, Verdana, Tahona, Helvetica.</p> <h2>Com Serifa</h2> <p>Exemplos: Times New Roman, Cambria, Georgia, Book Antiqua</p> <p>Outro fator importante para a legibilidade de um tipo de fonte é a existência ou não de caracteres ambíguos. Em alguns tipos de fonte, caracteres como o “I” (i maiúsculo) e a consoante “l” podem ser iguais, causando confusão. O mesmo ocorre com a letra “O” e o número zero (0). Em uma fonte com bom nível de acessibilidade deve ser possível distinguir facilmente os caracteres.</p> <p>Na imagem abaixo, podemos ver que os caracteres “i” maiúsculo e a consoante “l” são quase idênticos nas fontes Arial e Calibri, mas apresentam boa distinção nas fontes Tahoma e Verdana. Já o “o” maiúsculo e o número zero têm um formato distinto nas quatro fontes comparadas.</p> <img src=$img/fontes-2.png$ alt=$Exemplo de duas fontes, uma com serifa, e a outra serifada. A primeira linha diz &quot;Sem Serifa&quot;, escrito na fonte Arial. Embaixo há, entre parenteses, exemplos de fontes não serifadas, sendo estas Arial, Verdana, Tahoma e Helvetica. No segundo exemplo, está escrito &quot;Com Serifa&quot; na fonte Times New Roman, seguido de exemplos de fontes serifadas entre parentes, sendo estas Times New Roman, Cambria, Georgia e Book Antiqua$> <p>A popularidade de um tipo de fonte também pode ter papel importante na acessibilidade. Uma fonte comum é sempre mais indicada, já que a probabilidade de ela estar instalada no computador do usuário é grande. Se a fonte especificada para um site não é encontrada quando o usuário acessá-lo, o seu computador substitui por uma fonte comum que ele encontra instalada. Isso pode mudar drasticamente a apresentação visual do site. Assim, é importante especificar alternativas para a fonte escolhida através das folhas de estilo (CSS).</p> <p>Após escolher as fontes a serem utilizadas, é importante manter um padrão ao longo das páginas de um mesmo site, procurando, ainda, não utilizar muitos tipos de fonte em um mesmo site. O ideal é escolher uma fonte para título e outra para conteúdo e mantê-los em todas as páginas.</p> <h2>Outros fatores a serem considerados:</h2> <ul> <li>Utilizar texto real em vez de imagens de texto. As imagens de texto são imagens, ou seja, não são lidas pelos leitores de tela e dificultam a ampliação por quem tem baixa visão.</li> <li>Garantir um bom contraste entre a fonte e o plano de fundo. Existem ferramentas gratuitas para verificar a relação de contraste, como o Accessibility Color Wheel e o Color Contrast Checker.</li> <li>Limitar o uso de texto todo em negrito.</li> <li>Evitar texto todo em itálico.</li> <li>Evitar texto todo em maiúsculo.</li> <li>Evitar texto que se move ou pisca.</li> <li>Não utilizar fonte de letra cursiva ou decorada</li> </ul> <img src=$img/fontes-3.png$ alt=$Exemplo de ambiguidade de caracteres, mostrando o texto &quot;Ilustração O0&quot; em 4 diferentes fontes. Em ordem: Arial, Calibri, Tahoma, Verdana.$> <p>Ainda, existem tipos de fonte que foram criados especificamente para facilitar a leitura por pessoas com dificuldade nessa área, como é o caso da OpenDyslexic. Essa fonte apresenta caracteres com um formato diferenciado, específico para melhorar a leitura de pessoas com dislexia, já que proporciona uma maior distinção entre os caracteres, evitando causar confusão, como pode ser visto na comparação da imagem a seguir.</p> <img src=$img/fontes-4-768x343.png$ alt=$Seis exemplos visuais de práticas a se evitar ao utilizar fontes, fazendo o uso da prática para representá-la junto ao texto. A primeira diz &quot;Evitar utilizar texto todo em maiúsculo&quot;, a segunda diz &quot;Evitar utilziar texto todo em itálico&quot;, a terceira &quot;Limitar o uso de texto todo em negrito&quot;, a quarta diz &quot;Não utilizar fonte cursiva&quot;, a quinta &quot;Não utilizar fonte decorada&quot;, e por fim a sexta diz &quot;Cuidar com o contraste!&quot;, sendo este último o texto em amarelo forte e o fundo em verde.$> <p>Dar a devida atenção ao tipo de fonte e à forma como o texto é apresentado pode garantir que um conteúdo digital tenha uma maior abrangência, sendo acessível a um grupo maior de usuários. Além disso, é sempre mais agradável para qualquer usuário visitar um site ou acessar um conteúdo digital com uma boa aparência, facilidade de visualização e legibilidade.</p>"
 },
 {
  "id": 9,
  "content" : "<h1>Fontes para pessoas com dislexia</h1> <p>A dislexia é uma condição genética que dificulta o processo de leitura e escrita. A pessoa com dislexia pode trocar letras, especialmente as que possuem grafia parecida (como d/b, p/b ou j/i), pular ou inverter sílabas na hora de escrever, confundir palavras que têm sons semelhantes, pular palavras ou linhas durante a leitura e ter problemas para se localizar entre a esquerda e a direita no texto. Embora a dislexia não tenha cura, alguns recursos podem ser utilizados para auxiliar a pessoa com esta condição a ler e escrever com mais facilidade.</p> <p>Dentre esses recursos, um dos mais importantes é a fonte utilizada nos textos. É sempre recomendado escolher fontes limpas, claras e sem serifa (como Arial, Tahoma, Verdana e Calibri), pois fontes muito elaboradas ou com prolongamentos nas hastes tornam a leitura ainda mais difícil. Existem fontes que foram desenvolvidas especialmente para quem tem dislexia, como a OpenDyslexic (gratuita), Dyslexie (paga) e Sylexiad (gratuita). Algumas pessoas com dislexia relatam que o uso dessas fontes facilita sua leitura ou escrita de textos; porém isso não é uma regra. A preferência por um tipo de fonte ou outro é algo muito pessoal, e, por isso, recomenda-se fazer um teste com a pessoa, mostrando-lhe textos escritos com diversas fontes para que ela consiga escolher a de sua preferência</p>"
 },
 {
  "id" :10,
  "content" : " <h1>Avaliação de acessibilidade em sites</h1> <p>Um site acessível é aquele que garante acesso, utilização e compreensão ao maior número possível de usuários, independente de deficiência, limitação ou tecnologia utilizada. Mas, quando o assunto é acessibilidade, a pergunta mais frequente dos profissionais que desenvolvem para a Web é: como saber se meu site é acessível?</p> <p>A resposta para essa pergunta pode ser encontrada através das avaliações de acessibilidade, que são metodologias compostas por processos que objetivam encontrar barreiras de acessibilidade nas páginas e conteúdos da Web e, assim, corrigi-las tornando o site mais acessível. As avaliações de acessibilidade podem seguir alguns passos, porém não há uma metodologia universal para os testes</p> <p>Apresentamos a seguir uma proposta de avaliação de acessibilidade que combina a validação automática com a verificação manual.</p> <h2>Avaliação automática</h2> <p>Na etapa de avaliação automática são realizadas verificações utilizando ferramentas que validam o código HTML e CSS com base nos <a href=$https://www.w3c.br/Padroes/$>Padrões Web do W3C</a> e, também, ferramentas que realizam a avaliação automática específica de acessibilidade.</p> <p>Um site com código válido, ou seja, que segue os padrões de desenvolvimento Web já tem grandes chances de ter um bom nível de acessibilidade. A validação do código de acordo com os padrões Web é realizada utilizando o validador do W3C.</p> <p>Além de seguir os padrões Web, existem outras diretrizes específicas para garantir a acessibilidade, presentes em documentos como o <a href=$https://www.w3.org/TR/WCAG21/$>WCAG</a> (Web Content Accessibility Guidelines ou Diretrizes de Acessibilidade para Conteúdo Web), em nível internacional, e o <a href=$https://emag.governoeletronico.gov.br/$>eMAG</a> (Modelo de Acessibilidade em Governo Eletrônico), documento brasileiro. A avaliação automática de acessibilidade é realizada pelos chamados avaliadores de acessibilidade, que detectam o código HTML de uma página Web e fazem uma análise do seu conteúdo, com base nas recomendações de acessibilidade.</p> <p>Podemos citar como exemplos de avaliadores automáticos de acessibilidade o <a href=$https://accessmonitor.acessibilidade.gov.pt/$> AccessMonitor</a>, que é um avaliador português e o brasileiro <a href=$https://asesweb.governoeletronico.gov.br/$>ASES – Avaliador e Simulador de Acessibilidade em Sítios</a>. Após inserir o link da página a ser avaliada, os avaliadores de acessibilidade geram um relatório detalhado dos problemas encontrados. A tela que segue mostra um relatório de acessibilidade gerado pela ferramenta AccessMonitor, onde é possível clicar em cada erro ou aviso para maiores detalhes.</p> <img src=$img/avaliacao.png$ alt=$Exemplo de página web testada com o AccessMonitor. Os resultados dos testes realizados encontram-se em uma tabela, que mostra a quantidade de erros encontrados, avisos, elementos acessíveis e total de elementos testados. Há também uma relação de elementos HTML encontrados na página, e os erros correspondentes$> <p>Ainda, podem ser utilizados complementos/extensões para os navegadores que auxiliam na avaliação automática da acessibilidade, como:</p> <ul> <li><a href=$https://addons.mozilla.org/en-US/firefox/addon/wave-accessibility-tool/$>WAVE Accessibility Extension para Firefox</a></li> <li><a href=$https://chrome.google.com/webstore/detail/accessibility-developer-t/fpkknkljclfencbdbgkenhalefipecmb?hl=en$>Accessibility Developer Tools para Chrome</a></li> <li><a href=$https://chrome.google.com/webstore/detail/escanner/mpiipiobgejghkocofogeonfkapjgfmk?hl=pt-BR$>eScanner para Chrome</a></li> </ul> <p>Apesar de testarem um limitado conjunto de regras, os validadores são muito úteis durante o processo de desenvolvimento de aplicações Web acessíveis, pois ajudam o profissional a encontrar erros e esquecimentos, apontando, como corrigir os itens listados. No entanto, essas ferramentas sozinhas não são capazes de detectar todos os problemas de acessibilidade de um site. Para tal, utilizam-se análises manuais, que podem ser realizadas por usuários reais, especialmente aqueles com deficiência, utilizando diferentes tipos de tecnologia e por especialistas na área de acessibilidade na Web.</p> <h2>Avaliação Manual</h2> <p>A avaliação manual é uma etapa essencial na avaliação de acessibilidade de um site. Somente um usuário real poderá dizer se uma página está realmente acessível, compreensível e com boa usabilidade e não, simplesmente, tecnicamente acessível.</p> <p>Uma avaliação efetiva requer que o desenvolvedor tenha conhecimento sobre as diferentes tecnologias, as barreiras de acessibilidade enfrentadas por pessoas com deficiência e as técnicas ou recomendações de acessibilidade. Assim, é necessário que a avaliação seja realizada pelos desenvolvedores Web em conjunto com usuários reais, ou seja, pessoas com diferentes tipos de deficiência e utilizando diferentes tipos de tecnologia. Quanto maior e mais diversificado o número de usuários reais participando da avaliação de acessibilidade, mais eficaz e robusto será o resultado.</p> <h3>São alguns exemplos de pontos que devem ser verificados na avaliação manual de acessibilidade:</h3> <ul> <li>Código semântico: verificar se os elementos são utilizados de acordo com o seu real propósito, como por exemplo, descrições de links, uso de cabeçalhos, emprego de tabelas, formulários, dentre outros;</li> <li>Equivalentes textuais: verificar se foram fornecidas descrições para todas as informações visuais que transmitem conteúdo e se essas descrições são adequadas, como por exemplo, alternativas para imagens, descrições detalhadas para imagens complexas, inserção de imagens decorativas através de folhas de estilo, dentre outras;</li> <li>Alternativas para conteúdo multimídia: verificar se existem alternativas para o acesso da pessoa com deficiência ao conteúdo disponível em áudio e vídeo, como por exemplo, transcrições textuais, legendas, audiodescrição e alternativa em Libras (Língua Brasileira de Sinais);</li> <li>Emprego das cores: verificar o emprego da relação das cores nas páginas, como por exemplo, se a cor é utilizada como único recurso para transmitir informação, se a relação de contraste é adequada, se existe a opção de alto contraste, dentre outros;</li> <li>Tabelas: avaliar o emprego das tabelas para disponibilizar conteúdos, como por exemplo, se há tabelas que foram utilizadas para fins de diagramação, uso semântico dos elementos da tabela (cabeçalhos, linhas, células, etc.), se os cabeçalhos estão associados às células de dados, dentre outros;</li> <li>Documentos para download: verificar se os arquivos para download disponíveis no site estão em formatos acessíveis;</li> <li>Formulários: verificar se os campos estão associados às etiquetas, se existem dicas de preenchimento para os campos (data, telefone, endereço, etc.),se há a identificação correta de campos de preenchimento obrigatório, se a navegação pelo teclado ocorre de maneira lógica, dentre outros.</li> </ul> <p>Para auxiliar nessa etapa podem ser utilizados checklists de verificação manual, como os que estão disponíveis na página do <a href=$https://www.gov.br/governodigital/pt-br/estrategia-de-governanca-digital/do-eletronico-ao-digital$>Governo Digital – material de apoio</a>. Tais documentos têm como propósito auxiliar os desenvolvedores, usuários reais ou especialistas na área de acessibilidade a seguir um roteiro no momento de testar as páginas e desenvolver relatórios.</p> <p>Por fim, não existem metodologias universais para as avaliações de acessibilidade, mas seguir os passos abordados acima pode garantir um bom nível de acessibilidade a um site, portal ou sistema Web.</p> "
 },
 {
  "id": 11,
  "content" : "<h1>Boas práticas para descrição de imagens</h1> <img src=$img/18_BoasPrativasDescricaoImagens.jpg$ alt=$ícone da acessibilidade, de um olho e de um cego com uma bengala e o texto alt=descrição$> <p>Quem está acostumado a navegar pela Web, normalmente se depara com diversos tipos de imagens nas páginas: fotos, pinturas, gráficos, infográficos, organogramas, mapas, ilustrações, capturas de tela, e muitos outros elementos visuais. Esses recursos geralmente são utilizados para complementar, adicionar e ilustrar determinadas informações, ou apenas podem decorar/estilizar algum espaço digital. Assim, podemos identificar dois diferentes tipos de imagem: aquelas que transmitem conteúdo, como um gráfico, e aquelas que possuem apenas função decorativa, como um marcador estilizado.</p> <p>Na Web, tanto as imagens que transmitem conteúdo quanto as decorativas são inacessíveis a quem navega utilizando recursos de Tecnologia Assistiva, como o leitor de tela, a linha braille, navegadores em que as imagens estão desabilitadas, e navegadores textuais. Assim, uma pessoa cega ou surdocega, por exemplo, perderá toda a informação que é passada visualmente através de imagens, já que leitores de tela e linhas braille leem apenas texto. A solução é descrever textualmente todas as imagens que transmitem informações relevantes, transformando o que era apenas visual em texto, e possibilitando aos recursos de Tecnologia Assistiva interpretarem o conteúdo dos elementos de imagem.</p> <p>A descrição das imagens é inserida no texto alternativo. Em páginas Web, o texto alternativo deve constar no atributo “alt” do elemento <img>. Em documentos digitais, como os gerados a partir do Microsoft Office Word, Microsoft PowerPoint, LibreOffice Writer e LibreOffice Impress, é possível inseri-lo acessando as propriedades da imagem. Para saber como inserir texto alternativo em documentos digitais, faça o download do arquivo no final da notícia.</p> <h2>Como escrever um bom texto alternativo?</h2> <p>O texto alternativo deve ser fiel à imagem, englobando seus pontos fundamentais de forma clara, objetiva e sucinta. Uma boa ideia na hora de criar a descrição é perguntar-se “se eu não pudesse utilizar essa imagem aqui, o que escreveria em seu lugar?”, pois, desse modo, é provável que a alternativa textual corresponda de fato ao que a imagem transmite visualmente.</p> <p>Na imagem abaixo, a informação mais importante é o texto da campanha. A figura à esquerda, ilustrando uma mão aberta em uma placa, é apenas decorativa e não precisa constar na descrição. Portanto, um bom texto alternativo seria “Campanha Parada Pacto Nacional pela Redução de Acidentes, Um pacto pela Vida”.</p> <img src=$img/img-pacto.png$ alt=$Campanha Parada Pacto Nacional pela Redução de Acidentes, Um pacto pela Vida$> <p>Mas, nem sempre a imagem a ser descrita apresenta o conteúdo tão bem definido, e algumas dúvidas podem surgir sobre o que deve ou não ser colocado na descrição. As dicas abaixo podem auxiliá-lo a escrever o texto alternativo.</p> <ul> <li>Observe o contexto em que a imagem está inserida para saber o que deve ou não constar na descrição. Na maioria das vezes, o importante é o conteúdo essencial da imagem, e deve-se, portanto, evitar descrições muito detalhadas. Mas, é possível que em algum contexto específico seja importante, além de descrever a informação principal, fornecer também detalhes da composição e estrutura da imagem.</li> </ul> <p>No contexto, por exemplo, de uma notícia que apresente algumas informações sobre o Viver sem Limite, seguida de uma imagem do logo desse plano, o essencial é informar o texto do logo. Não é necessário explicar o estilo gráfico (cores, estrutura, design) utilizado, pois a falta desse tipo de detalhe não prejudica o entendimento de quem não visualiza a imagem. Então, nesse caso, apenas um texto alternativo breve seria suficiente para contemplá-la.</p> <img src=$img/img-viver-sem-limite.jpg$ alt=$Logo do Viver sem Limite: Plano Nacional dos Direitos da Pessoa com Deficiência.$> <p>Exemplo de texto alternativo breve (informa o mais importante da imagem): Logo do Viver sem Limite: Plano Nacional dos Direitos da Pessoa com Deficiência.</p> <p>Já em um contexto diferente, como por exemplo, em um site que apresente obras de arte, é provável que a pessoa queira saber cada detalhe da composição das pinturas, e, nesse caso, uma descrição longa e detalhada se faz necessária.</p> <img src=$img/img-obra.jpg$ alt=$Uma mulher trajando um vestido rosado com pequenos detalhes em amarelo está de costas para o observador. Ela usa um chapéu bege de aba comprida com uma fita escura que é amarrada abaixo do queixo. Sobre a aba do chapéu, há um ramo com pequenas flores. O vestido é aberto na parte de trás, o que possibilita a visualização das costas da mulher. Seu braço esquerdo está dobrado e sua mão segura um ramo de flores. O braço direito está estendido, de modo a apoiar a mão sobre uma cadeira no canto. O fundo da pintura é escuro, pintado de marrom.$> <p>Exemplo de descrição para obras de arte (fornece detalhes específicos da composição): Uma mulher trajando um vestido rosado com pequenos detalhes em amarelo está de costas para o observador. Ela usa um chapéu bege de aba comprida com uma fita escura que é amarrada abaixo do queixo. Sobre a aba do chapéu, há um ramo com pequenas flores. O vestido é aberto na parte de trás, o que possibilita a visualização das costas da mulher. Seu braço esquerdo está dobrado e sua mão segura um ramo de flores. O braço direito está estendido, de modo a apoiar a mão sobre uma cadeira no canto. O fundo da pintura é escuro, pintado de marrom.</p> <ul> <li>Não repita na descrição da imagem o que já foi explicado anteriormente no corpo do texto. Caso o próprio texto contemple toda a informação presente na imagem, deixe-a sem nenhum texto alternativo ou forneça uma descrição simples.</li> </ul> <p>Abaixo, podemos perceber que o próprio texto da notícia já contém as informações mais importantes da imagem. Nesse contexto, a descrição poderia ser simplesmente “Convite da 3ª Conferência Municipal dos Direitos da Pessoa com Deficiência”, ou ainda, estar vazio.</p> <img src=$img/img-prefeitura.png$ alt=$Convite da 3ª Conferência Municipal dos Direitos da Pessoa com Deficiência”, ou ainda, estar vazio$> <ul> <li>Não utilize as palavras “imagem de…” para iniciar uma descrição. Os leitores de tela informam automaticamente ao usuário que o elemento lido é uma imagem, sendo desnecessário repetir a informação no texto alternativo. Porém, no caso de capturas de tela, fotos e/ou retratos, é recomendável indicar qual é a natureza da imagem. Assim, quando necessário, utilize as frases “captura de tela de…”, “foto de…”, “pintura de…” no início da descrição.</li> <li>Verifique se a imagem passa algum conteúdo relevante ou é apenas decorativa. Imagens puramente decorativas, que não acrescentam conteúdo ao texto, não devem ser descritas.</li> <li>Utilize pontuação e acentuação adequadas em todas as frases. Também é importante que as palavras estejam corretamente escritas, para evitar que o leitor de tela se confunda durante a leitura do texto.</li> <li>Não repita o texto da legenda no texto alternativo. Os leitores de tela lerão as duas informações, sendo que apenas uma já é suficiente. O texto alternativo deve ser utilizado para descrever detalhes adicionais da imagem, que não foram citados na legenda.</li> </ul> <p>A legenda abaixo, por exemplo, já informa o que é importante na imagem. Nesse caso, o texto alternativo pode ficar vazio. Adicionar alguma descrição como “Capa do relatório final da 3ª Conferência Nacional dos Direitos da Pessoa com Deficiência” no texto alternativo acabaria se tornando repetitivo, pois a legenda já contém a mesma informação.</p> <img src=$img/img-conferencia.png$ alt=$Capa do relatório final da 3ª Conferência Nacional dos Direitos da Pessoa com Deficiência$> <p>Já na imagem a seguir, a legenda contribui para a compreensão da ideia transmitida, mas sozinha não é suficiente para englobar todo o conteúdo. Portanto, você deve utilizar o texto alternativo, acrescentando as informações que faltam para que ela seja compreendida em conjunto com a legenda.</p> <img src=$img/img-dislexia.png$ alt=$Cinco ilustrações de pessoas, com as palavras “TDAH”, “Disgrafia”, “Dislexia”, “Daltonismo” e “TEA” escritas uma em cada ilustração. Abaixo, destaca-se a frase “Nem sempre limitações são visíveis”. $> <p>Legenda: Imagem representando algumas limitações fisicamente imperceptíveis</p> <p>Exemplo de texto alternativo: Cinco ilustrações de pessoas, com as palavras “TDAH”, “Disgrafia”, “Dislexia”, “Daltonismo” e “TEA” escritas uma em cada ilustração. Abaixo, destaca-se a frase “Nem sempre limitações são visíveis”.</p> <ul> <li>Imagens complexas, como gráficos, podem ser descritas de duas maneiras: inserindo a descrição no próprio texto ou disponibilizando-a em outra página através de um link. Nesses casos, a explicação textual auxilia não somente quem utiliza alguma Tecnologia Assistiva, mas também pessoas com dificuldades de compreender dados dispostos em forma de gráficos.</li> </ul> <p>Na imagem abaixo, há um exemplo de descrição do gráfico no próprio texto e em um link adjacente. No texto alternativo da imagem, insira o título do gráfico, por exemplo, “Gráfico demonstrativo da Deficiência no Brasil segundo o Censo do IBGE 2010”. Para detalhar os dados, utilize ou a explicação no próprio contexto, ou o link abaixo do gráfico, pois eles possuem praticamente as mesmas informações.</p> <img src=$img/img-grafico.png$ alt=$exemplo de gráfico, representando os tipos de deficiência no Brasil$> <ul> <li>Para descrever infográficos pode-se colocar um link abaixo da imagem, da mesma forma que é feito com os gráficos, ou fornecer a descrição no texto alternativo da imagem. Recomenda-se colocar descrições não muito extensas no texto alternativo, portanto se o infográfico for muito complexo e possuir muitos dados, prefira disponibilizar um link contendo a descrição em outra página.</li> </ul> <p>Abaixo há um exemplo de descrição para o infográfico disponibilizada em outra página. No texto alternativo desta imagem poderia ser colocado simplesmente “Infográfico trazendo curiosidades sobre a água”. Caso não seja possível fornecer o link abaixo da imagem, coloque a descrição completa do infográfico no texto alternativo.</p> <img src=$img/info-certo-noticia.png$ alt=$Infográfico de Curiosidades sobre a Água, trazendo textos e imagens decorativas relacionadas à água. 768 milhões de pessoas não têm acesso a nenhuma fonte de água potável no mundo. O Brasil é um dos países que mais desperdiça água potável no mundo, sendo que 37% de toda a água tratada no Brasil em 2013 foi desperdiçada. A quantidade de água recomendada pela OMS para uma pessoa é de 110 litros por dia, mas cada brasileiro consome em média 200 litros de água por dia. Um desumidificador retira 480 litros de água a cada 24 horas$> <p>Exemplo de descrição textual do infográfico acima: Infográfico de Curiosidades sobre a Água, trazendo textos e imagens decorativas relacionadas à água. 768 milhões de pessoas não têm acesso a nenhuma fonte de água potável no mundo. O Brasil é um dos países que mais desperdiça água potável no mundo, sendo que 37% de toda a água tratada no Brasil em 2013 foi desperdiçada. A quantidade de água recomendada pela OMS para uma pessoa é de 110 litros por dia, mas cada brasileiro consome em média 200 litros de água por dia. Um desumidificador retira 480 litros de água a cada 24 horas.</p> <p>Para materiais digitais mais complexos, como livros didáticos, que contenham história em quadrinhos, cartum, mapas, tirinhas e outros, em especial livros produzidos no formato Daisy, o MEC possui diretrizes que especificam a forma como a imagem deve ser descrita através da Nota Técnica nº 21.</p> "
 },
 {
  "id": 12,
  "content" : "<h1>ARIA ou WAI-ARIA e o que você precisa saber a respeito</h1> <p>ARIA está relacionado a acessibilidade. O termo é um acrônimo para Acessible Rich Internet Applications. Ele também é comumente utilizado com o acrônimo WAI de Web Acessibility Initiative, ou WAI-ARIA.</p> <p>Acessibilidade é um assunto que você precisa considerar e se inteirar a respeito. O potencial para os negócios é enorme, assim como o respeito para com os usuários que precisam dela.</p> <p>O potencial é grande, uma vez que você aumentará sua base de usuários. Cegos, pessoas com dificuldades motoras e em outras situações também acessam a internet, e elas também tem potencial de compra, interação e claro, direito ao acesso a informação.</p> <h2>ARIA e WordPress</h2> <p>O WordPress faz uso do ARIA. Tanto no tema padrão disponibilizado junto a plataforma quanto nas marcações HTML entregues pelo core.</p> <p>O painel administrativo também faz uso da solução para garantir uma maior acessibilidade de uso da plataforma. O que significa dizer que portadores de necessidades especiais conseguirão gerir sua presença na internet e publicar conteúdos.</p> <p>Infelizmente, poucos temas e plugins o adotam. Na verdade, a questão acessibilidade é levado em questão muita poucas vezes, exceto em alguns ocasiões que a questão é lei, obrigatoriedade.</p> <h2>Porque o assunto ganha força</h2> <p>Interfaces ricas tem se popularizado. O uso de widgets e componentes para interfaces ganham cada vez mais força. Frameworks e bibliotecas JavaScript surgem a todo momento.</p> <p>Solução como o React está no auge. Soluções para aproveitar a mesma interface do desktop em aplicativos móveis também. Uma coisa comum nessas soluções são o uso de widgets e componentes.</p> <p>No entanto, os componentes são uma combinação de HTML, CSS e JavaScript que criam experiências ricas utilizando uma marcação, na maioria das vezes, HTML inacessível, com pouca, ou nenhuma, semântica e isso torna a interface comprometida para um considerável público.</p> <p>ARIA ganha força por que resolve isso. Ou seja, é a solução para deixar acessível e guiar as Tecnologias Assistidas a fazerem bom uso das interfaces ricas que estamos desenvolvendo.</p> <h2>O que preciso saber a respeito</h2> <img src=$img/wai-aria-piramide.webp$ alt=$Uma piramide com as escritas do topo para baixo: Aria, JavaScript, Css, Html$> <p>Primeiro que seu desenvolvimento deve almejar o maior alcance possível de usuários. Para isso, é necessário desenvolver de forma acessível a marcação HTML codificada.</p> <p>Segundo que é muito simples e fácil de ser implementada. São simples atributos HTML lógicos que darão significados semânticos e instruções de interação aos leitores de tela.</p> <p>Terceiro que você poderá continuar desenvolvendo seus componentes em sua zona de conforto, poderá adicionar facilmente aos existentes. Suas interfaces que usam scripts complexos não precisarão ser refeitas, elas simplesmente vão ganhar alguns atributos nas marcações HTML existentes.</p> <p>ARIA é organizado em dois quesitos: Roles (função, papel) e States (estado) e Properties (propriedades). Através das Roles você define que o elemento é. Com os States e Properties você informará o comportamento do elemento (se está aberto, fechado, clicado e etc).</p> <h2>Sobre as Roles</h2> <p>As Roles no ARIA tem quatro categorias: Abstract, Widgets, Document Structure e Landmark. Os três últimos que são utilizados junto as marcações de conteúdo</p> <h3>Widget Roles</h3> <p>Widgets são elementos que funcionam de forma autônoma aos demais elementos de uma página. Para eles há uma categoria específica de ARIA que nos permite marca o widget inteiro ou parte dele.</p> <p>Elementos como accordion, abas, caixas de alerta, botões e vários outros.</p> <h3>Document Structure</h3> <p>Esta categoria de ARIA marca estruturas não interativas da página. Article, heading, region, separator são exemplos.</p> <h3>Landmarks</h3> <p>Esta categoria é a mais utilizada, a mais simples e a qual você deve focar em seu início com ARIA. Ela marca regiões navegáveis da página e as opções de uso são as seguintes:</p> <ul> <li>application;</li> <li>banner;</li> <li>complementary;</li> <li>contentinfo;</li> <li>form;</li> <li>main;</li> <li>navigation;</li> <li>search</li> </ul> <p>Em alguns casos esses nomes serão redundantes aos nomes das suas classes CSS.</p> <p>Exemplos práticos de marcação HTML SEM o uso das Landmarks</p> <img src=$img/img-1.png$ alt=$Codigos html$> <p>Exemplos práticos de marcação HTML COM o uso das Landmarks</p> <img src=$img/img-2.png$ alt=$Codigos html$> <p>Além do atributo role é importante usar o atributo aria-label para fornecer mais informações sobre a região. Ainda mais se for uma role que não exibe nenhum texto na tela.</p> <p>Os exemplos anteriores com a aplicação do aria-label ficariam assim:</p> <img src=$img/img-3.png$ alt=$Codigos html$> <h3>Conclusão</h3> <p>ARIA é importante e simples de usar. Seu uso agregará valor semântico a sua marcação HTML. Isso tornará seu projeto mais acessível. Você alcançará mais usuários. Sua marca será mais respeitada.</p> "
 }
]